tap "anomalyco/tap"
tap "laishulu/homebrew"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Dependency Manager for PHP
brew "composer"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Modern, maintained replacement for ls
brew "eza"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# YAML Parser
brew "libyaml"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Non-interactive SSH password auth
brew "sshpass"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# View/select the URLs in an email message or file
brew "urlscan"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Android SDK component
cask "android-platform-tools"
# Desktop password and login vault
cask "bitwarden"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Clipboard manager
cask "maccy"
# Replacement for Docker Desktop
cask "orbstack"
# Snip or pin screenshots
cask "snipaste"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
mas "QQ", id: 451108668
mas "WPS Office", id: 1468073139
mas "微信", id: 836500024
vscode "aaron-bond.better-comments"
vscode "alexdauenhauer.catppuccin-noctis"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "beishanyufu.ime-and-cursor"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "draivin.hscopes"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "georgewfraser.vscode-javac"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "hancel.google-translate"
vscode "humao.rest-client"
vscode "jinliming2.vscode-go-template"
vscode "leetcode.vscode-leetcode"
vscode "maciejdems.add-to-gitignore"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mkhl.direnv"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nefrob.vscode-just-syntax"
vscode "nguyenhuy158.xml-formater"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "oracle.oracle-java"
vscode "orangex4.vscode-smart-ime"
vscode "pixl-garden.bongocat"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "romantomjak.go-template"
vscode "syler.ignore"
vscode "tim-koehler.helm-intellisense"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "walkme.java-extension-pack"
vscode "wholroyd.jinja"
vscode "whosydd.prettier-config"
vscode "wmaurer.vscode-jumpy"
vscode "yinfei.luahelper"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
go "cmd/go"
go "cmd/gofmt"
npm "corepack"
